
 Feature: Потребетелят иска да направи резервация за прожекция

 Background:
 Given Потребителят отваря екрана за резервация

  Scenario: Правене на успешна резервация
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "mitko@abv.bg"
    And Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 3
    And Избере кои места: 10
    And Кога е направил резервация: 2022, 2,2, 15, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Успешно направихте резервация!"
    
 
    
  Scenario: Правене на резервация без имена
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "kolo@abv.bg"
    And Въведе валиден номер: "0897654321"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 8
    And Избере кои места: 15
   And Кога е направил резервация: 2022, 2,2, 13, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Не сте въвели всички задължителни полета!"
    
  Scenario: Правене на резервация без имейл
    When Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 11
    And Избере кои места: 20
    And Кога е направил резервация: 2022, 2,2, 11, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Не сте въвели всички задължителни полета!"
    
  Scenario: Правене на резервация без телефон
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "kolo@abv.bg"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 4
    And Избере кои места: 30
    And Кога е направил резервация: 2022, 2,2, 10, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Не сте въвели всички задължителни полета!"
    
  Scenario: Правене на резервация с вече заети места
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "kolo@abv.bg"
    And Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 18
    And Избере кои места: 10
    And Кога е направил резервация: 2022, 2,2, 11, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Не можете да направите резервация, защото местата са заети"
    
   Scenario: Правене на резервация по-малко от 60 мин. преди прожекция
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "kolo@abv.bg"
    And Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 10
    And Избере кои места: 30
    And Кога е направил резервация: 2022, 2,2, 16, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Не можете да направите резервация по-малко от 60 мин. преди прожекция!"
    

    
     Scenario: Правене на резервация без да е избрал кино
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "mitko@abv.bg"
    And Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 10
    And Избере кои места: 18
    And Кога е направил резервация: 2022, 2,2, 10, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Моля, въведете кино!"
    
   Scenario: Правене на резервация без да е избрал филм
    When Въведе валиден имейл адрес, на който да се изпрати имейл за потвръждение на резервацията: "mitko@abv.bg"
    And Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 7
    And Избере кои места: 12
    And Кога е направил резервация: 2022, 2,2, 15, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Моля, въведете филм!"
    
 
    
  Scenario: Правене на резервация с невалиден имейл
    When Въведе невалиден имейл адрес "mitkoabv.bg"
    And Въведе валиден номер: "0897654321"
    And Въведе име: "Nikola"
    And Въведе фамилия: "Nikolov"
    And Избере в кое кино: "Cinema city"
    And Избере кой филм: "Lotr"
    And Избере коя прожекция на филм: 2022, 2,2, 17, 0
    And Избере на кой ред: 3
    And Избере кои места: 31
    And Кога е направил резервация: 2022, 2,2, 14, 0
    And Натисне бутон за резервация
    Then Получава съобщение: "Невалиден имейл!"
    
   
  
   
  
    
    
  


